# -*- coding: UTF-8 -*-

# 3.1415926	{:.2f}	3.14	保留小数点后两位
# 3.1415926	{:+.2f}	+3.14	带符号保留小数点后两位
# -1	{:+.2f}	-1.00	带符号保留小数点后两位
print("{:+.2f}".format(-1))
# 2.71828	{:.0f}	3	不带小数
# 5	{:0>2d}	05	数字补零 (填充左边, 宽度为2)
# 5	{:x<4d}	5xxx	数字补x (填充右边, 宽度为4)
# 10	{:x<4d}	10xx	数字补x (填充右边, 宽度为4)
# 1000000	{:,}	1,000,000	以逗号分隔的数字格式
# 0.25	{:.2%}	25.00%	百分比格式
# 1000000000	{:.2e}	1.00e+09	指数记法
# 13	{:10d}	        13	右对齐 (默认, 宽度为10)
print "right","{:10d}".format(123)
print "right","{:>10d}".format(123)
# 13	{:<10d}	13	左对齐 (宽度为10)
print "left", "{:<10d}".format(123)
# 13	{:^10d}	    13	中间对齐 (宽度为10)
print "middle", "{:^10d}".format(123)

# b、d、o、x 分别是二进制、十进制、八进制、十六进制。
print('{:b}'.format(11))   #1011
print('{:d}'.format(11))   #11
print('{:o}'.format(11))   #13
print('{:x}'.format(11))   #b
print('{:#x}'.format(11))  #0xb
print('{:#X}'.format(11))  #0XB
